masoame/cmake_stm32f103c8t6/user/src/rc522.cpp
#include "rc522.hpp"
#include "common.hpp"
#include "stm32f1xx_hal_spi.h"
#include <cstdint>
#include <sys/types.h>

// uint8_t UID[5],Temp[4];
//  uint8_t RF_Buffer[18];
//  uint8_t Password_Buffer[6]={0xFF,0xFF,0xFF,0xFF,0xFF,0xFF}; // Mifare One 缺省密码

// void RC522_Init(void)
// {
// 	RC522_SDA_LOW;
// 	HAL_SPI_Transmit(&hspi2, (uint8_t *)0xaa, sizeof(uint8_t), 0xFF);//启动传输
// 	RC522_SDA_HIGH();

//   HAL_Delay(50);
//   PcdReset();//复位RC522读卡器
//   HAL_Delay(10);
//   PcdReset();//复位RC522读卡器
//   HAL_Delay(10);
//   PcdAntennaOff();//关闭天线发射
//   HAL_Delay(10);
//   PcdAntennaOn();//开启天线发射
// 	common::printf<>("RFID-MFRC522 初始化完成\r\nFindCard Starting ...\r\n");  //测试引脚初始化完成
// }

// SPIx 读写一个字节
// TxData:要写入的字节
// 返回值:读取到的字节
//***************************************************************************/

// char RC522_ReadWriteByte(uint8_t TxData)
// {
//   uint8_t RxData;
//   HAL_SPI_TransmitReceive(&hspi2, &TxData, &RxData, 1, 20);
// 	return RxData;
// }

// //******************************************************************/
// //功    能：读RC522寄存器
// //参数说明：Address[IN]:寄存器地址
// //返    回：读出的值
// //******************************************************************/
// unsigned char ReadRawRC(unsigned char Address)
// {
// 	uint8_t ucAddr;
//   uint8_t ucResult=0;
// 	RC522_SDA_LOW;
// 	HAL_Delay(10);
//    ucAddr = ((Address<<1)&0x7E)|0x80;
// 	RC522_ReadWriteByte(ucAddr);
// 	HAL_Delay(10);
// 	ucResult=RC522_ReadWriteByte(0);
// 	HAL_Delay(10);
// 	RC522_SDA_HIGH();
//   return ucResult;
// }

// //******************************************************************/
// //功    能：写RC522寄存器
// //参数说明：Address[IN]:寄存器地址
// //          value[IN]:写入的值
// //******************************************************************/
// void WriteRawRC(unsigned char Address, unsigned char value)
// {
// 	uint8_t ucAddr;
// 	RC522_SDA_LOW;
// 	HAL_Delay(10);
// 	ucAddr = ((Address<<1)&0x7E) ;
// 	RC522_ReadWriteByte(ucAddr);
// 	HAL_Delay(10);
// 	RC522_ReadWriteByte(value);
// 	HAL_Delay(10);
// 	RC522_SDA_HIGH();
// }

// //******************************************************************/
// //功    能：置RC522寄存器位
// //参数说明：reg[IN]:寄存器地址
// //          mask[IN]:置位值
// //******************************************************************/
// void SetBitMask(unsigned char reg,unsigned char mask)
// {
//   char tmp = 0x0;
//   tmp = ReadRawRC(reg)| mask;
//   WriteRawRC(reg,tmp | mask);  // set bit mask
// }

// //******************************************************************/
// //功    能：清RC522寄存器位
// //参数说明：reg[IN]:寄存器地址
// //          mask[IN]:清位值
// //******************************************************************/
// void ClearBitMask(unsigned char reg,unsigned char mask)
// {
//   char tmp = 0x0              ;
//   tmp = ReadRawRC(reg)&(~mask);
//   WriteRawRC(reg, tmp)        ;  // clear bit mask
// }

// //******************************************************************/
// //功    能：复位RC522
// //返    回: 成功返回MI_OK
// //******************************************************************/
// char PcdReset()
// {
//   RC522_RST_HIGH;
//   common::delay_ns(10);
//   RC522_RST_LOW;
//   common::delay_ns(100);
//   RC522_RST_HIGH;
//   common::delay_ns(10);
//   WriteRawRC(CommandReg,PCD_RESETPHASE);
//   common::delay_ns(100);
//   WriteRawRC(ModeReg,0x3D);                  //定义发送和接收常用模式 和Mifare卡通讯，CRC初始值0x6363
//   WriteRawRC(TReloadRegL,30);                //16位定时器低位 30
//   WriteRawRC(TReloadRegH,0);                 //16位定时器高位
//   WriteRawRC(TModeReg,0x8D);                 //定义内部定时器的设置
//   WriteRawRC(TPrescalerReg,0x3E);            //设置定时器分频系数
//   WriteRawRC(TxASKReg,0x40);                 //调制发送信号为100%ASK
//   return MI_OK;
// }
//////////////////////////////////////////////////////////////////////
// 设置RC522的工作方式
//////////////////////////////////////////////////////////////////////
// char MF522PcdConfigISOType(unsigned char  type)
// {
// 	if (type == 'A')	//ISO14443_A
// 		{
// 			ClearBitMask(Status2Reg,0x08);	//状态2寄存器
// 			WriteRawRC(ModeReg,0x3D);	//3F  //和Mifare卡通讯，CRC初始值0x6363
// 			WriteRawRC(RxSelReg,0x86);	//84   选择内部接收器设置，内部模拟部分调制信号，发送数据后，延迟6个位时钟，接收
// 			WriteRawRC(RFCfgReg,0x7F);	//4F  配置接收器  48dB最大增益
// 			WriteRawRC(TReloadRegL,30);	//tmoLength);TReloadVal = 'h6a =tmoLength(dec)
// 			WriteRawRC(TReloadRegH,0);	//实际值是OXD3E 这部分主要是设置定时器寄存器
// 			WriteRawRC(TModeReg,0x8D);
// 			WriteRawRC(TPrescalerReg,0x3E);
// 			common::delay_ns(1000);
// 			PcdAntennaOn();
// 		}
// 	else {return 0xFE;}
// 	return MI_OK;
// }

// //******************************************************************/
// //开启天线发射
// //每次启动或关闭天险发射之间应至少有1ms的间隔
// //******************************************************************/
// void PcdAntennaOn()
// {
//   unsigned char i;
//   WriteRawRC(TxASKReg,0x40)       ;
//   HAL_Delay(1);
//   i = ReadRawRC(TxControlReg)     ;
//   if(!(i&0x03))
//     SetBitMask(TxControlReg, 0x03);
//   i=ReadRawRC(TxASKReg)       ;
// }

// //******************************************************************/
// //关闭天线发射
// //******************************************************************/
// void PcdAntennaOff()
// {
//   ClearBitMask(TxControlReg, 0x03);
// }

// //******************************************************************/
// //功    能：通过RC522和ISO14443卡通讯
// //参数说明：Command[IN]:RC522命令字
// //          pInData[IN]:通过RC522发送到卡片的数据
// //          InLenByte[IN]:发送数据的字节长度
// //          pOutData[OUT]:接收到的卡片返回数据
// //          *pOutLenBit[OUT]:返回数据的位长度
// //******************************************************************/
// char PcdComMF522(unsigned char Command  ,unsigned char *pInData ,
//                  unsigned char InLenByte,unsigned char *pOutData,
//                  unsigned int  *pOutLenBit                       )
// {
//   char status = MI_ERR                          ;
//   unsigned char irqEn   = 0x00                  ;
//   unsigned char waitFor = 0x00                  ;
//   unsigned char lastBits                        ;
//   unsigned char n                               ;
//   unsigned int  i                               ;
//   switch (Command)
//   {
//     case PCD_AUTHENT:
//       irqEn   = 0x12                            ;
//       waitFor = 0x10                            ;
//       break                                     ;
//     case PCD_TRANSCEIVE:
//       irqEn   = 0x77                            ;
//       waitFor = 0x30                            ;
//       break                                     ;
//     default:
//       break                                     ;
//   }
//   WriteRawRC(ComIEnReg,irqEn|0x80)              ; //
//   ClearBitMask(ComIrqReg,0x80)                  ;
//   WriteRawRC(CommandReg,PCD_IDLE)               ;
//   SetBitMask(FIFOLevelReg,0x80)                 ; // 清空FIFO
//   for(i=0; i<InLenByte; i++)
//     WriteRawRC(FIFODataReg,pInData[i])          ; // 数据写入FIFO
//   WriteRawRC(CommandReg, Command)               ; // 命令写入命令寄存器
//   if(Command == PCD_TRANSCEIVE)
//     SetBitMask(BitFramingReg,0x80)              ; // 开始发送
//   i = 6000                                      ; //根据时钟频率调整，操作M1卡最大等待时间25ms
//   do
//   {
//     n = ReadRawRC(ComIrqReg)                    ;
//     i--                                         ;
//   }
//   while((i!=0)&&!(n&0x01)&&!(n&waitFor))        ;
//   ClearBitMask(BitFramingReg,0x80)              ;
//   if(i!=0)
//   {
//     if(!(ReadRawRC(ErrorReg)&0x1B))
//     {
//       status = MI_OK                            ;
//       if (n&irqEn&0x01)
//         status = MI_NOTAGERR                    ;
//       if(Command==PCD_TRANSCEIVE)
//       {
//         n = ReadRawRC(FIFOLevelReg)             ;
//         lastBits = ReadRawRC(ControlReg)&0x07   ;
//         if(lastBits)
//           *pOutLenBit = (n-1)*8 + lastBits      ;
//         else
//           *pOutLenBit = n*8                     ;
//         if(n==0)
//           n = 1                                 ;
//         if(n>MAXRLEN)
//           n = MAXRLEN                           ;
//         for (i=0; i<n; i++)
//           pOutData[i] = ReadRawRC(FIFODataReg)  ;
//       }
//     }
//     else
//       status = MI_ERR                           ;
//   }
//   SetBitMask(ControlReg,0x80)                   ;// stop timer now
//   WriteRawRC(CommandReg,PCD_IDLE)               ;
//   return status;
// }

