masoame/cmake_stm32f103c8t6/user/src/rc522.cpp
//******************************************************************/
// 功    能：寻卡                                                    /
// 参数说明: req_code[IN]:寻卡方式                                   /
//                0x52 = 寻感应区内所有符合14443A标准的卡           /
//                0x26 = 寻未进入休眠状态的卡                       /
//                pTagType[OUT]：卡片类型代码                       /
//                0x4400 = Mifare_UltraLight                        /
//                0x0400 = Mifare_One(S50)                          /
//                0x0200 = Mifare_One(S70)                          /
//                0x0800 = Mifare_Pro(X)                            /
//                0x4403 = Mifare_DESFire                           /
// 返    回: 成功返回MI_OK                                           /
//******************************************************************/
// char PcdRequest(unsigned char req_code,unsigned char *pTagType)
// {
//   char status                                        ;
//   unsigned int  unLen                                ;
//   unsigned char ucComMF522Buf[MAXRLEN]               ;

//   ClearBitMask(Status2Reg,0x08)                      ;//清除MRCrypto1on，要用软件清零
//   WriteRawRC(BitFramingReg,0x07)                     ;//startsend=0,rxalign=0,在FIFO中存放的位置，TXlastbit=7
//   SetBitMask(TxControlReg,0x03)                      ;//TX2rfen=1,TX1RFen=1,传递调制的13.56MHZ的载波信号

//   ucComMF522Buf[0] = req_code                        ;

//   status = PcdComMF522(PCD_TRANSCEIVE,ucComMF522Buf,1,ucComMF522Buf,&unLen       );
//   if ((status == MI_OK) && (unLen == 0x10))
//   {
//     *pTagType     = ucComMF522Buf[0]                 ;
//     *(pTagType+1) = ucComMF522Buf[1]                 ;
//   }
//   else
//     status = MI_ERR                                  ;
//   return status                                      ;
// }

//******************************************************************/
// 功    能：防冲撞                                                  /
// 参数说明: pSnr[OUT]:卡片序列号，4字节                             /
// 返    回: 成功返回MI_OK                                           /
//******************************************************************/
// char PcdAnticoll(unsigned char *pSnr)
// {
//     char status;
//     unsigned char i,snr_check=0;
//     unsigned int  unLen;
//     unsigned char ucComMF522Buf[MAXRLEN];

//     ClearBitMask(Status2Reg,0x08);//清除MRCrypto1on，要用软件清零
//     WriteRawRC(BitFramingReg,0x00);//表示最后一个字节所有位都发送
//     ClearBitMask(CollReg,0x80);//CollRegCollReg0冲突结束后冲突位被置零

//     ucComMF522Buf[0] = PICC_ANTICOLL1;
//     ucComMF522Buf[1] = 0x20;

//     status = PcdComMF522(PCD_TRANSCEIVE,ucComMF522Buf,2,ucComMF522Buf,&unLen);

//     if (status == MI_OK)
//     {
//     	 for (i=0; i<4; i++)
//          {
//              *(pSnr+i)  = ucComMF522Buf[i];
//              snr_check ^= ucComMF522Buf[i];
//          }
//          if (snr_check != ucComMF522Buf[i])
//          {   status = MI_ERR;    }
//     }

//     SetBitMask(CollReg,0x80);//CollRegCollReg 在106kbps良好的防冲突情况下该位置1
//     return status;
// }

/////////////////////////////////////////////////////////////////////
// 功    能：选定卡片
// 参数说明: pSnr[IN]:卡片序列号，4字节
// 返    回: 成功返回MI_OK
/////////////////////////////////////////////////////////////////////
// char PcdSelect(unsigned char *pSnr)
//{
//     char status;
//     unsigned char i;
//     unsigned int  unLen;
//     unsigned char ucComMF522Buf[MAXRLEN];
//
//     ucComMF522Buf[0] = PICC_ANTICOLL1;
//     ucComMF522Buf[1] = 0x70;
//     ucComMF522Buf[6] = 0;
//     for (i=0; i<4; i++)
//     {
//     	ucComMF522Buf[i+2] = *(pSnr+i);
//     	ucComMF522Buf[6]  ^= *(pSnr+i);
//     }
//     CalulateCRC(ucComMF522Buf,7,&ucComMF522Buf[7]);
//
//     ClearBitMask(Status2Reg,0x08);//清零MFcryon

//    status = PcdComMF522(PCD_TRANSCEIVE,ucComMF522Buf,9,ucComMF522Buf,&unLen);
//
//    if ((status == MI_OK) && (unLen == 0x18))
//    {   status = MI_OK;  }
//    else
//    {   status = MI_ERR;    }

//    return status;
//}

////******************************************************************/
////功    能：验证卡片密码
////参数说明: auth_mode[IN]: 密码验证模式
////                 0x60 = 验证A密钥
////                 0x61 = 验证B密钥
////          addr[IN]：块地址
////          pKey[IN]：密码
////          pSnr[IN]：卡片序列号，4字节
////返    回: 成功返回MI_OK
////******************************************************************/
// char PcdAuthState(unsigned char auth_mode,unsigned char addr,
//                   unsigned char *pKey,unsigned char *pSnr    )
//{
//     char status;
//     unsigned int  unLen;
//     unsigned char i,ucComMF522Buf[MAXRLEN];

//    ucComMF522Buf[0] = auth_mode;//验证A密钥
//    ucComMF522Buf[1] = addr;//addr[IN]：块地址
//    for (i=0; i<6; i++)
//    {    ucComMF522Buf[i+2] = *(pKey+i);   }
//    for (i=0; i<6; i++)
//    {    ucComMF522Buf[i+8] = *(pSnr+i);   }
//
//    status = PcdComMF522(PCD_AUTHENT,ucComMF522Buf,12,ucComMF522Buf,&unLen);
//    if ((status != MI_OK) || (!(ReadRawRC(Status2Reg) & 0x08)))
//    {   status = MI_ERR;   }
//
//    return status;
//}



////******************************************************************/
////功    能：读取M1卡一块数据
////参数说明: addr[IN]：块地址
////          pData[OUT]：读出的数据，16字节
////返    回: 成功返回MI_OK
////******************************************************************/
// char Read_Block(unsigned char Block,unsigned char *Buf)
//{
//   char result                                             ;
//   result = PcdAuthState(0x60,Block,Password_Buffer,UID)   ;
//   if(result!=MI_OK)
//     return result                                         ;
//   result = PcdRead(Block,Buf)                             ;
////  return result; // 2011.01.03
//
//  if(result!=MI_OK)     return   result                   ;
//  if(Block!=0x00&&des_on)
//  {
////     Des_Decrypt((char *)Buf    ,KK,(char *)Buf    )       ;
////     Des_Decrypt((char *)&Buf[8],KK,(char *)&Buf[8])       ;
//  }
//  return SUCCESS                                          ;
//}

////******************************************************************/
////功    能：写数据到M1卡一块
////参数说明: addr[IN]：块地址
////          pData[IN]：写入的数据，16字节
////返    回: 成功返回MI_OK
////******************************************************************/
// char PcdWrite(unsigned char addr,unsigned char *pData)
//{
//   char status                                             ;
//   unsigned int  unLen                                     ;
//   unsigned char i,ucComMF522Buf[MAXRLEN]                  ;
//
//   ucComMF522Buf[0] = PICC_WRITE                           ;
//   ucComMF522Buf[1] = addr                                 ;
//   CalulateCRC(ucComMF522Buf,2,&ucComMF522Buf[2])          ;
//   status = PcdComMF522(PCD_TRANSCEIVE,ucComMF522Buf,4,
//                        ucComMF522Buf,&unLen          )    ;
//   if(  ( status != MI_OK)||(unLen != 4)
//      ||((ucComMF522Buf[0]&0x0F)!= 0x0A))
//     status = MI_ERR                                       ;
//   if (status == MI_OK)
//   {
//     for (i=0; i<16; i++)
//       ucComMF522Buf[i] = *(pData+i)                       ;
//     CalulateCRC(ucComMF522Buf,16,&ucComMF522Buf[16])      ;
//     status = PcdComMF522(PCD_TRANSCEIVE,ucComMF522Buf,
//                          18,ucComMF522Buf,&unLen     )    ;
//     if(  (status != MI_OK)||(unLen != 4 )
//        ||((ucComMF522Buf[0]&0x0F)!= 0x0A))
//       status = MI_ERR                                     ;
//   }
//   return status                                           ;
// }
////******************************************************************/
////功    能：写数据到M1卡一块
////参数说明: addr[IN]：块地址
////          pData[IN]：写入的数据，16字节
////返    回: 成功返回MI_OK
////******************************************************************/

// char Write_Block(unsigned char Block)
//{
//   char result                                             ;
//   if(des_on)
//   {
////     Des_Encrypt((char *)RF_Buffer    ,KK,   (char *)RF_Buffer )                ;// for debug
////     Des_Encrypt((char *)&RF_Buffer[8],KK,   (char *)&RF_Buffer[8]  )                ;// for debug
//  }
//  result = PcdAuthState(0x60,Block,Password_Buffer,UID)   ;
//  if(result!=MI_OK)
//    return result                                         ;
//  result = PcdWrite(Block,RF_Buffer)                      ;
//  return result                                           ;
//}

////******************************************************************/
////功    能：扣款和充值
////参数说明: dd_mode[IN]：命令字
////               0xC0 = 扣款
////               0xC1 = 充值
////          addr[IN]：钱包地址
////          pValue[IN]：4字节增(减)值，低位在前
////返    回: 成功返回MI_OK
////******************************************************************/
// char PcdValue(unsigned char dd_mode,unsigned char addr,unsigned char *pValue)
//{
//     char status;
//     unsigned int  unLen;
//     unsigned char i,ucComMF522Buf[MAXRLEN];
//
//     ucComMF522Buf[0] = dd_mode;
//     ucComMF522Buf[1] = addr;
//     CalulateCRC(ucComMF522Buf,2,&ucComMF522Buf[2]);
//
//     status = PcdComMF522(PCD_TRANSCEIVE,ucComMF522Buf,4,ucComMF522Buf,&unLen);

//    if ((status != MI_OK) || (unLen != 4) || ((ucComMF522Buf[0] & 0x0F) != 0x0A))
//    {   status = MI_ERR;   }
//
//    if (status == MI_OK)
//    {
//        for (i=0; i<16; i++)
//        {    ucComMF522Buf[i] = *(pValue+i);   }
//        CalulateCRC(ucComMF522Buf,4,&ucComMF522Buf[4]);
//        unLen = 0;
//        status = PcdComMF522(PCD_TRANSCEIVE,ucComMF522Buf,6,ucComMF522Buf,&unLen);
//        if (status != MI_ERR)
//        {    status = MI_OK;    }
//    }
//
//    if (status == MI_OK)
//    {
//        ucComMF522Buf[0] = PICC_TRANSFER;
//        ucComMF522Buf[1] = addr;
//        CalulateCRC(ucComMF522Buf,2,&ucComMF522Buf[2]);
//
//        status = PcdComMF522(PCD_TRANSCEIVE,ucComMF522Buf,4,ucComMF522Buf,&unLen);

//        if ((status != MI_OK) || (unLen != 4) || ((ucComMF522Buf[0] & 0x0F) != 0x0A))
//        {   status = MI_ERR;   }
//    }
//    return status;
//}

////******************************************************************/
////功    能：备份钱包
////参数说明: sourceaddr[IN]：源地址
////          goaladdr[IN]：目标地址
////返    回: 成功返回MI_OK
////******************************************************************/
// char PcdBakValue(unsigned char sourceaddr, unsigned char goaladdr)
//{
//     char status;
//     unsigned int  unLen;
//     unsigned char ucComMF522Buf[MAXRLEN];

