masoame/cmake_stm32f103c8t6/user/src/rc522.cpp
//    ucComMF522Buf[0] = PICC_RESTORE;
//    ucComMF522Buf[1] = sourceaddr;
//    CalulateCRC(ucComMF522Buf,2,&ucComMF522Buf[2]);
//
//    status = PcdComMF522(PCD_TRANSCEIVE,ucComMF522Buf,4,ucComMF522Buf,&unLen);

//    if ((status != MI_OK) || (unLen != 4) || ((ucComMF522Buf[0] & 0x0F) != 0x0A))
//    {   status = MI_ERR;   }
//
//    if (status == MI_OK)
//    {
//        ucComMF522Buf[0] = 0;
//        ucComMF522Buf[1] = 0;
//        ucComMF522Buf[2] = 0;
//        ucComMF522Buf[3] = 0;
//        CalulateCRC(ucComMF522Buf,4,&ucComMF522Buf[4]);
//
//        status = PcdComMF522(PCD_TRANSCEIVE,ucComMF522Buf,6,ucComMF522Buf,&unLen);
//        if (status != MI_ERR)
//        {    status = MI_OK;    }
//    }
//
//    if (status != MI_OK)
//    {    return MI_ERR;   }
//
//    ucComMF522Buf[0] = PICC_TRANSFER;
//    ucComMF522Buf[1] = goaladdr;

//    CalulateCRC(ucComMF522Buf,2,&ucComMF522Buf[2]);
//
//    status = PcdComMF522(PCD_TRANSCEIVE,ucComMF522Buf,4,ucComMF522Buf,&unLen);

//    if ((status != MI_OK) || (unLen != 4) || ((ucComMF522Buf[0] & 0x0F) != 0x0A))
//    {   status = MI_ERR;   }

//    return status;
//}

//******************************************************************/
// 功    能：命令卡片进入休眠状态
// 返    回: 成功返回MI_OK
//******************************************************************/
// char PcdHalt(void)
//{
//    char status;
//    unsigned int  unLen;
//    unsigned char ucComMF522Buf[MAXRLEN];

//    ucComMF522Buf[0] = PICC_HALT;
//    ucComMF522Buf[1] = 0;
//    CalulateCRC(ucComMF522Buf,2,&ucComMF522Buf[2]);
//
//    status = PcdComMF522(PCD_TRANSCEIVE,ucComMF522Buf,4,ucComMF522Buf,&unLen);
//    return status;
////    return MI_OK;
//}

//******************************************************************/
// 功    能：命令卡片进入休眠状态
// 返    回: 成功返回MI_OK
//******************************************************************/
// char MIF_Halt(void)
//{
//    char status;
//    unsigned int  unLen;
//    unsigned char ucComMF522Buf[MAXRLEN];

//    ucComMF522Buf[0] = PICC_HALT;
//    ucComMF522Buf[1] = 0;
//    CalulateCRC(ucComMF522Buf,2,&ucComMF522Buf[2]);
//
//    status = PcdComMF522(PCD_TRANSCEIVE,ucComMF522Buf,4,ucComMF522Buf,&unLen);
//    return status ;
////    return MI_OK;
//}

//******************************************************************/
// 用MF522计算CRC16函数
//******************************************************************/
// void CalulateCRC(unsigned char *pIndata,unsigned char len,unsigned char *pOutData)
//{
//    unsigned char i,n;
//    ClearBitMask(DivIrqReg,0x04);
//    WriteRawRC(CommandReg,PCD_IDLE);//取消当前命令
//    SetBitMask(FIFOLevelReg,0x80);//FlushBuffer 清除ErrReg 的标志位
//    for (i=0; i<len; i++)
//    {   WriteRawRC(FIFODataReg, *(pIndata+i));   }
//    WriteRawRC(CommandReg, PCD_CALCCRC);
//    i = 0xFF;
//    do
//    {
//        n = ReadRawRC(DivIrqReg);
//        i--;
//    }
//    while ((i!=0) && !(n&0x04));//当CRCIRq所有数据被处理完毕该位置位
//    pOutData[0] = ReadRawRC(CRCResultRegL);//显示计算出来的CRC值
//    pOutData[1] = ReadRawRC(CRCResultRegM);
//}

namespace rfid {

rc522::rc522(SPI_HandleTypeDef* const hspi, GPIO_TypeDef* const sda_port, const uint16_t sda_pin, GPIO_TypeDef* const rst_port, const uint16_t rst_pin)
    : m_hspi(hspi)
    , m_sda_port(sda_port)
    , m_sda_pin(sda_pin)
    , m_rst_port(rst_port)
    , m_rst_pin(rst_pin)
{
    this->RC522_SDA_LOW();
    HAL_SPI_Transmit(this->m_hspi, (uint8_t*)0xaa, sizeof(uint8_t), 0xFF); // 启动传输
    this->RC522_SDA_HIGH();

    HAL_Delay(50);
    this->PcdReset(); // 复位RC522读卡器
    HAL_Delay(10);
    this->PcdReset(); // 复位RC522读卡器
    HAL_Delay(10);
    this->PcdAntennaOff(); // 关闭天线发射
    HAL_Delay(10);
    this->PcdAntennaOn(); // 开启天线发射
    // common::printf("RFID-MFRC522 初始化完成\r\nFindCard Starting ...\r\n");  //测试引脚初始化完成
}
char rc522::PcdReset()
{
    this->RC522_RST_HIGH();
    common::delay_ns(10);
    this->RC522_RST_LOW();
    common::delay_ns(100);
    this->RC522_RST_HIGH();
    common::delay_ns(10);
    this->WriteRawRC(CommandReg, PCD_RESETPHASE);
    common::delay_ns(100);
    this->WriteRawRC(ModeReg, 0x3D); // 定义发送和接收常用模式 和Mifare卡通讯，CRC初始值0x6363
    this->WriteRawRC(TReloadRegL, 30); // 16位定时器低位 30
    this->WriteRawRC(TReloadRegH, 0); // 16位定时器高位
    this->WriteRawRC(TModeReg, 0x8D); // 定义内部定时器的设置
    this->WriteRawRC(TPrescalerReg, 0x3E); // 设置定时器分频系数
    this->WriteRawRC(TxASKReg, 0x40); // 调制发送信号为100%ASK
    return MI_OK;
}
char rc522::PcdRequest(unsigned char req_code, unsigned char* pTagType)
{
    char status;
    unsigned int unLen;
    unsigned char ucComMF522Buf[MAXRLEN];

    this->ClearBitMask(Status2Reg, 0x08); // 清除MRCrypto1on，要用软件清零
    this->WriteRawRC(BitFramingReg, 0x07); // startsend=0,rxalign=0,在FIFO中存放的位置，TXlastbit=7
    this->SetBitMask(TxControlReg, 0x03); // TX2rfen=1,TX1RFen=1,传递调制的13.56MHZ的载波信号

    ucComMF522Buf[0] = req_code;

    status = this->PcdComMF522(PCD_TRANSCEIVE, ucComMF522Buf, 1, ucComMF522Buf, &unLen);
    if ((status == MI_OK) && (unLen == 0x10)) {
        *pTagType = ucComMF522Buf[0];
        *(pTagType + 1) = ucComMF522Buf[1];
    } else
        status = MI_ERR;
    return status;
}

char rc522::PcdAnticoll(unsigned char* pSnr)
{
    char status;
    unsigned char i, snr_check = 0;
    unsigned int unLen;
    unsigned char ucComMF522Buf[MAXRLEN];

    this->ClearBitMask(Status2Reg, 0x08); // 清除MRCrypto1on，要用软件清零
    this->WriteRawRC(BitFramingReg, 0x00); // 表示最后一个字节所有位都发送
    this->ClearBitMask(CollReg, 0x80); // CollRegCollReg0冲突结束后冲突位被置零

    ucComMF522Buf[0] = PICC_ANTICOLL1;
    ucComMF522Buf[1] = 0x20;

    status = this->PcdComMF522(PCD_TRANSCEIVE, ucComMF522Buf, 2, ucComMF522Buf, &unLen);

    if (status == MI_OK) {
        for (i = 0; i < 4; i++) {
            *(pSnr + i) = ucComMF522Buf[i];
            snr_check ^= ucComMF522Buf[i];
        }
        if (snr_check != ucComMF522Buf[i]) {
            status = MI_ERR;
        }
    }

    this->SetBitMask(CollReg, 0x80); // CollRegCollReg 在106kbps良好的防冲突情况下该位置1
    return status;
}

char rc522::PcdComMF522(unsigned char Command, unsigned char* pInData, unsigned char InLenByte, unsigned char* pOutData, unsigned int* pOutLenBit)
{
    char status = MI_ERR;
    unsigned char irqEn = 0x00;
    unsigned char waitFor = 0x00;
    unsigned char lastBits;
    unsigned char n;
    unsigned int i;
    switch (Command) {
    case PCD_AUTHENT:
        irqEn = 0x12;
        waitFor = 0x10;
        break;
    case PCD_TRANSCEIVE:
        irqEn = 0x77;
        waitFor = 0x30;
        break;
    default:
        break;
    }
    this->WriteRawRC(ComIEnReg, irqEn | 0x80);
    this->ClearBitMask(ComIrqReg, 0x80);
    this->WriteRawRC(CommandReg, PCD_IDLE);
    this->SetBitMask(FIFOLevelReg, 0x80);
    for (i = 0; i < InLenByte; i++)
        this->WriteRawRC(FIFODataReg, pInData[i]);
    this->WriteRawRC(CommandReg, Command);
    if (Command == PCD_TRANSCEIVE)
        this->SetBitMask(BitFramingReg, 0x80);
    i = 6000;
    do {
        n = this->ReadRawRC(ComIrqReg);
        i--;
    } while ((i != 0) && !(n & 0x01) && !(n & waitFor));
    this->ClearBitMask(BitFramingReg, 0x80);
    if (i != 0) {
        if (!(this->ReadRawRC(ErrorReg) & 0x1B)) {
            status = MI_OK;
            if (n & irqEn & 0x01)
                status = MI_NOTAGERR;
            if (Command == PCD_TRANSCEIVE) {
                n = this->ReadRawRC(FIFOLevelReg);
                lastBits = this->ReadRawRC(ControlReg) & 0x07;
                if (lastBits)
                    *pOutLenBit = (n - 1) * 8 + lastBits;
                else
                    *pOutLenBit = n * 8;
                if (n == 0)
                    n = 1;
                if (n > MAXRLEN)
                    n = MAXRLEN;
                for (i = 0; i < n; i++)
                    pOutData[i] = this->ReadRawRC(FIFODataReg);
            }
        } else
            status = MI_ERR;
    }
    this->SetBitMask(ControlReg, 0x80);
    this->WriteRawRC(CommandReg, PCD_IDLE);
    return status;
}

void rc522::PcdAntennaOn()
{
    unsigned char i;
    this->WriteRawRC(TxASKReg, 0x40);
    HAL_Delay(1);
    i = ReadRawRC(TxControlReg);
    if (!(i & 0x03))
        this->SetBitMask(TxControlReg, 0x03);
    i = this->ReadRawRC(TxASKReg);
}

