masoame/cmake_stm32f103c8t6/user/src/rc522.cpp
void rc522::PcdAntennaOff()
{
    this->ClearBitMask(TxControlReg, 0x03);
}

char rc522::RC522_ReadWriteByte(uint8_t TxData)
{
    uint8_t RxData;
    HAL_SPI_TransmitReceive(this->m_hspi, &TxData, &RxData, 1, 20);
    return RxData;
}

unsigned char rc522::ReadRawRC(unsigned char Address)
{
    uint8_t ucAddr;
    uint8_t ucResult = 0;
    this->RC522_SDA_LOW();
    HAL_Delay(10);
    ucAddr = ((Address << 1) & 0x7E) | 0x80;
    this->RC522_ReadWriteByte(ucAddr);
    HAL_Delay(10);
    ucResult = this->RC522_ReadWriteByte(0);
    HAL_Delay(10);
    this->RC522_SDA_HIGH();
    return ucResult;
}

void rc522::WriteRawRC(unsigned char Address, unsigned char value)
{
    uint8_t ucAddr;
    this->RC522_SDA_LOW();
    HAL_Delay(10);
    ucAddr = ((Address << 1) & 0x7E);
    this->RC522_ReadWriteByte(ucAddr);
    HAL_Delay(10);
    this->RC522_ReadWriteByte(value);
    HAL_Delay(10);
    this->RC522_SDA_HIGH();
}

void rc522::SetBitMask(unsigned char reg, unsigned char mask)
{
    char tmp = 0x0;
    tmp = this->ReadRawRC(reg) | mask;
    this->WriteRawRC(reg, tmp | mask);
}

void rc522::ClearBitMask(unsigned char reg, unsigned char mask)
{
    char tmp = 0x0;
    tmp = this->ReadRawRC(reg) & (~mask);
    this->WriteRawRC(reg, tmp);
}

std::string rc522::ReaderCard(void)
{
    std::string result;
    uint32_t CardId;
    auto Temp = reinterpret_cast<uint8_t*>(&CardId);
    if (this->PcdRequest(PICC_REQALL, Temp) == MI_OK) // 选卡
    {
        if (Temp[0] == 0x04 && Temp[1] == 0x00)
            result = "MFOne-S50\r\n";
        else if (Temp[0] == 0x02 && Temp[1] == 0x00)
            result = "MFOne-S70\r\n";
        else if (Temp[0] == 0x44 && Temp[1] == 0x00)
            result = "MF-UltraLight\r\n";
        else if (Temp[0] == 0x08 && Temp[1] == 0x00)
            result = "MF-Pro\r\n";
        else if (Temp[0] == 0x44 && Temp[1] == 0x03)
            result = "MF Desire\r\n";
        else
            result = "Unknown\r\n";
        if (this->PcdAnticoll(this->m_uid) == MI_OK) {
            return result + common::FormatString("Card Id is: %X\r\n", *reinterpret_cast<uint32_t*>(this->m_uid));
        }
        //return result;
    }
    return {};
}
/*
 * 函数名：CalulateCRC
 * 描述  ：用RC522计算CRC16
 * 输入  ：pIndata，计算CRC16的数组
 *         ucLen，计算CRC16的数组字节长度
 *         pOutData，存放计算结果存放的首地址
 * 返回  : 无
 * 调用  ：内部调用
 */
 void rc522::CalulateCRC ( unsigned char * pIndata, unsigned char ucLen, unsigned char * pOutData )
 {
    unsigned char uc, ucN;
 
     ClearBitMask(DivIrqReg, 0x04);
 
     WriteRawRC(CommandReg, PCD_IDLE);
 
     SetBitMask(FIFOLevelReg, 0x80);
 
     for ( uc = 0; uc < ucLen; uc ++)
         WriteRawRC ( FIFODataReg, * ( pIndata + uc ) );
 
     WriteRawRC ( CommandReg, PCD_CALCCRC );
 
     uc = 0xFF;
 
     do
     {
         ucN = ReadRawRC ( DivIrqReg );
         uc --;
     } while ( ( uc != 0 ) && ! ( ucN & 0x04 ) );
 
     pOutData [ 0 ] = ReadRawRC ( CRCResultRegL );
     pOutData [ 1 ] = ReadRawRC ( CRCResultRegM );
 }

////******************************************************************/
////功    能：读取M1卡一块数据
////参数说明: addr[IN]：块地址
////          pData[OUT]：读出的数据，16字节
////返    回: 成功返回MI_OK
////******************************************************************/
char rc522::PcdRead(unsigned char addr,unsigned char *pData)
{
    char status;
    unsigned int  unLen;
    unsigned char i,ucComMF522Buf[MAXRLEN];

   ucComMF522Buf[0] = PICC_READ;
   ucComMF522Buf[1] = addr;
   CalulateCRC(ucComMF522Buf,2,&ucComMF522Buf[2]);
   status = PcdComMF522(PCD_TRANSCEIVE,ucComMF522Buf,4,ucComMF522Buf,&unLen);
   if ((status == MI_OK) && (unLen == 0x90))
   {
       for (i=0; i<16; i++)
           *(pData+i) = ucComMF522Buf[i];
   }
   else
     status = MI_ERR;
   return status;
}


}